app/Controllers/Cursos.php

SELECT *
FROM `cursos`
ORDER BY `id` ASC
---
    public function index(){

        //se crea el objeto de clase Curso
        $curso = new Curso();
        /*se crea un array e indico que se orden la información por id y en forma ascedente
        y que se busquen todos los registros. Todo se va a depositar en $datos[]*/
        $datos['cursos'] = $curso->orderBy('id', 'ASC')->findAll();

INSERT INTO `cursos` (`nombre`, `imagen`) VALUES ('CodeIgniter II', '1648532524_7ed04eb01caa03f8436e.jpg')
---
    public function guardar(){

        //es necesario crear la instancia
        $cursito = new Curso();
        $nuevoNombre = '';
        /*apenas recepcionamos el nombre
        $nombre = $this->request->getVar('nombre');
        se va a recepcionar la imagen */
        if($imagen = $this->request->getFile('imagen')){
            //le generamos un nuevo nombre de imagen
            $nuevoNombre = $imagen->getRandomName();
            //movemos al servidor en public
            $imagen->move('..public/uploads',$nuevoNombre);

        } //cierro el if de la imagen
        $datos=[
            'nombre'=> $this->request->getVar('nombre'),
            'imagen'=>$nuevoNombre
        ];
        $cursito->insert($datos);